<a href="https://colab.research.google.com/github/IndraniMandal/CSC310-S20/blob/master/08-data-manipulation-pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
# preamble to be able to run notebooks in Jupyter and Colab
try:
    from google.colab import drive
    import sys
    
    drive.mount('/content/drive')
    notes_home = "/content/drive/CSC310/notes/"
    user_home = "/content/drive/My Drive/"
    
    sys.path.insert(1,notes_home) # let the notebook access the notes folder

except ModuleNotFoundError:
    notes_home = "" # running native Jupyter environment -- notes home is the same as the notebook
    user_home = ""  # under Jupyter we assume the user directory is the same as the notebook

Mounted at /content/drive

# Data Manipulation with Pandas

Pandas supports 1-D (Series), 2-D (DataFrame), and 3-D (Panel) data structures.  Here we cover DataFrames because they most closely resemble the kind of data tables data scientists mostly look at.

The advantage of Pandas is that it stores the data together with its *metadata*.

The most often used meta data with Pandas are the **column names** and the **index**.

In [4]:
import pandas
import numpy # for random number generation

In [60]:
df = pandas.read_csv("/content/drive/My Drive/CSC310/notes/assets/mammals.csv")

In [61]:
df

   Legs Wings  Fur Feathers  Mammal
0     4    no  yes       no    True
1     2   yes   no      yes   False
2     4    no   no       no   False
3     4   yes  yes       no    True
4     3    no   no       no   False

# DataFrame Parts

A dataframe is composed of different parts that work together to give a coherent view of the data:

In [ ]:
df.columns

Index(['Legs', 'Wings', 'Fur', 'Feathers', 'Mammal'], dtype='object')

In [67]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
df.values

array([[4, 'no', 'yes', 'no', True],
       [2, 'yes', 'no', 'yes', False],
       [4, 'no', 'no', 'no', False],
       [4, 'yes', 'yes', 'no', True],
       [3, 'no', 'no', 'no', False]], dtype=object)

We can change the parts of the data.  For example, we can create a new index for our dataframe:

In [68]:
df.index = ['Dog', 'Duck', 'Frog', 'Bat', 'Bar Stool']

In [69]:
df

           Legs Wings  Fur Feathers  Mammal
Dog           4    no  yes       no    True
Duck          2   yes   no      yes   False
Frog          4    no   no       no   False
Bat           4   yes  yes       no    True
Bar Stool     3    no   no       no   False

# Indexing and Slicing

For array-style indexing Pandas  uses the **loc**, **iloc**, and **ix** indexers. 

Using the **iloc** indexer, we can index the underlying array as if it is a simple array using row and column integer values (hence the i in iloc). The DataFrame index and column labels are maintained in the result:

In [ ]:
df

           Legs Wings  Fur Feathers  Mammal
Dog           4    no  yes       no    True
Duck          2   yes   no      yes   False
Frog          4    no   no       no   False
Bat           4   yes  yes       no    True
Bar Stool     3    no   no       no   False

In [ ]:
df.iloc[:2,1:4]

     Wings  Fur Feathers
Dog     no  yes       no
Duck   yes   no      yes

Using the **loc** indexer we can index the underlying data in an array-like style but using the explicit index and column names:

In [ ]:
df.loc[:'Duck','Wings':'Feathers']

     Wings  Fur Feathers
Dog     no  yes       no
Duck   yes   no      yes

Notice that when slicing with an explicit index (i.e., data.loc['a':'c']), the final index is included in the slice, while when slicing with an implicit index (i.e., data.iloc[0:2]), the final index is excluded from the slice.

The indexer **ix** allows the mix of integer and explicit indexing.

# Data Access Patterns

We can use relational and boolean expressions when selecting data from a dataframe.

In order to see that we have to realize that there is another simple way to select frame columns:

In [ ]:
df[['Wings', 'Mammal']] # using a list of column names to access columns

          Wings  Mammal
Dog          no    True
Duck        yes   False
Frog         no   False
Bat         yes    True
Bar Stool    no   False

Relational Operators:

In [ ]:
df[df.Wings == 'yes'] # accessing rows for which the equality holds

      Legs Wings  Fur Feathers  Mammal
Duck     2   yes   no      yes   False
Bat      4   yes  yes       no    True

In [ ]:
df[df.Wings == 'yes'].Mammal # accessing attribute values for rows for which the equality holds

Duck    False
Bat      True
Name: Mammal, dtype: bool

In [ ]:
df[(df.Wings == 'yes') & (df.Fur == 'yes')] # boolean operations

     Legs Wings  Fur Feathers  Mammal
Bat     4   yes  yes       no    True

# Filtering

Boolean indexing using a Boolean

In [62]:
df.Mammal

0     True
1    False
2    False
3     True
4    False
Name: Mammal, dtype: bool

In [ ]:
df.Mammal.dtype

dtype('bool')

In [64]:
df[df.Mammal == False] # or we could have just said df[df.Mammal]

   Legs Wings Fur Feathers  Mammal
1     2   yes  no      yes   False
2     4    no  no       no   False
4     3    no  no       no   False

In [65]:
df

   Legs Wings  Fur Feathers  Mammal
0     4    no  yes       no    True
1     2   yes   no      yes   False
2     4    no   no       no   False
3     4   yes  yes       no    True
4     3    no   no       no   False

In [70]:
df

           Legs Wings  Fur Feathers  Mammal
Dog           4    no  yes       no    True
Duck          2   yes   no      yes   False
Frog          4    no   no       no   False
Bat           4   yes  yes       no    True
Bar Stool     3    no   no       no   False

Filtering using **isin()**

In [71]:
df.index.isin(['Dog','Bat'])

array([ True, False, False,  True, False])

Any Boolean vector can be used as filter.

In [ ]:
v = df.index.isin(['Dog','Bat'])
df[v]

     Legs Wings  Fur Feathers  Mammal
Dog     4    no  yes       no    True
Bat     4   yes  yes       no    True

# Combining DataFrames

## Using concat() along axis 1 (columns)

In [72]:
df1 = df.iloc[:,:2]
df1

           Legs Wings
Dog           4    no
Duck          2   yes
Frog          4    no
Bat           4   yes
Bar Stool     3    no

In [73]:
df2 = df.iloc[:,2:]
df2

           Fur Feathers  Mammal
Dog        yes       no    True
Duck        no      yes   False
Frog        no       no   False
Bat        yes       no    True
Bar Stool   no       no   False

In [22]:
pandas.concat([df1,df2],axis=1)

           Legs Wings  Fur Feathers  Mammal
Dog           4    no  yes       no    True
Duck          2   yes   no      yes   False
Frog          4    no   no       no   False
Bat           4   yes  yes       no    True
Bar Stool     3    no   no       no   False

**Note** The two dataframes have to agree on the index!

Creating a new index on df2:

In [23]:
df2.reset_index(drop=True, inplace=True)
df2

   Fur Feathers  Mammal
0  yes       no    True
1   no      yes   False
2   no       no   False
3  yes       no    True
4   no       no   False

In [14]:
df1

           Legs Wings
Dog           4    no
Duck          2   yes
Frog          4    no
Bat           4   yes
Bar Stool     3    no

In [ ]:
pandas.concat([df1,df2],axis=1)

           Legs Wings  Fur Feathers Mammal
0           NaN   NaN  yes       no   True
1           NaN   NaN   no      yes  False
2           NaN   NaN   no       no  False
3           NaN   NaN  yes       no   True
4           NaN   NaN   no       no  False
Bar Stool   3.0    no  NaN      NaN    NaN
Bat         4.0   yes  NaN      NaN    NaN
Dog         4.0    no  NaN      NaN    NaN
Duck        2.0   yes  NaN      NaN    NaN
Frog        4.0    no  NaN      NaN    NaN

### Using concat() along axis 0 (rows)

In [15]:
piece1 = df.iloc[:2,:]
piece1

      Legs Wings  Fur Feathers  Mammal
Dog      4    no  yes       no    True
Duck     2   yes   no      yes   False

In [16]:
piece2 = df.iloc[2:,:]
piece2

           Legs Wings  Fur Feathers  Mammal
Frog          4    no   no       no   False
Bat           4   yes  yes       no    True
Bar Stool     3    no   no       no   False

In [18]:
pandas.concat([piece1, piece2],axis=0)

           Legs Wings  Fur Feathers  Mammal
Dog           4    no  yes       no    True
Duck          2   yes   no      yes   False
Frog          4    no   no       no   False
Bat           4   yes  yes       no    True
Bar Stool     3    no   no       no   False

In [25]:
piece1.append(piece2)

           Legs Wings  Fur Feathers  Mammal
Dog           4    no  yes       no    True
Duck          2   yes   no      yes   False
Frog          4    no   no       no   False
Bat           4   yes  yes       no    True
Bar Stool     3    no   no       no   False

**Note** dataframes have to agree on column names!

**append** and **assign** functions work very similarly.

# Missing or Duplicated Data
* Pandas flags missing values with NaN (not a number).
* In most cases, any computations applied to a dataframe with NaNs will ignore the NaNs
* However, it is still a good idea to clean up the dataframe
* In general we have two options to deal with missing data:
 * Either drop the row or columns that has NaNs
 * Or try to substitute a reasonable value for the NaN

Generate a dataset with NaNs

In [75]:
df = pandas.DataFrame(numpy.random.randn(4, 3), index=['a', 'c', 'd', 'e'], 
                  columns=['one', 'two', 'three'])
df

        one       two     three
a -0.272183  0.424625  0.374375
c -1.429586  0.735792 -0.298281
d -0.295857 -0.206647 -0.670271
e  0.732602  0.724723  0.008543

Generating NaNs

In [76]:
df2 = df.reindex(['a', 'b', 'c', 'd', 'e','f'])
df2

        one       two     three
a -0.272183  0.424625  0.374375
b       NaN       NaN       NaN
c -1.429586  0.735792 -0.298281
d -0.295857 -0.206647 -0.670271
e  0.732602  0.724723  0.008543
f       NaN       NaN       NaN

In [77]:
# find the places where the NaNs are
df2.isnull()

     one    two  three
a  False  False  False
b   True   True   True
c  False  False  False
d  False  False  False
e  False  False  False
f   True   True   True

In [80]:
df2.one[df2.one.isnull()]

b   NaN
f   NaN
Name: one, dtype: float64

In [81]:
# look at the values of the isnull dataframe
df2.isnull().values

array([[False, False, False],
       [ True,  True,  True],
       [False, False, False],
       [False, False, False],
       [False, False, False],
       [ True,  True,  True]])

In [82]:
# find out how many values are missing
# NOTE: sum treats 'True' as 1 and 'False' as 0 
df2.isnull().values.sum()

6

In [ ]:
# drop rows that have NaNs
df2.dropna(how='any',axis=0)

        one       two     three
a  0.631913  0.679473 -0.504080
c -0.558343 -0.705497  0.968311
d  0.695184  0.426475 -0.516462
e  0.934925  0.377162  0.605510

In [ ]:
# dropping columns that have NaNs
# NOTE: this is NOT always a good idea -- empty dataframe!
df2.dropna(how='any',axis=1)

Empty DataFrame
Columns: []
Index: [a, b, c, d, e]

# Replacing Missing Data

We can also try to estimate the missing data - **impute** it.

We replace the missing values by the means of each column.

In [84]:
df2

        one       two     three
a -0.272183  0.424625  0.374375
b       NaN       NaN       NaN
c -1.429586  0.735792 -0.298281
d -0.295857 -0.206647 -0.670271
e       NaN       NaN       NaN
f       NaN       NaN       NaN

In [85]:
# compute the mean of each column
df2.mean()

one     -0.665875
two      0.317923
three   -0.198059
dtype: float64

In [86]:
# fill the missing values in each column
for c in df.columns:
    df2[c].fillna(df[c].mean(), inplace=True)

df2

        one       two     three
a -0.272183  0.424625  0.374375
b -0.316256  0.419623 -0.146409
c -1.429586  0.735792 -0.298281
d -0.295857 -0.206647 -0.670271
e -0.316256  0.419623 -0.146409
f -0.316256  0.419623 -0.146409

# Broadcasting

Binary arithmetic operators are applied element by element to dataframes assuming equal sized dataframes.

Broadcasting refers to the fact that Python will reuse elements of the smaller dataframe or will reuse a scalar in order to complete the binary operation.

In [ ]:
df = pandas.DataFrame([[1,2],[3,4]])
df

   0  1
0  1  2
1  3  4

In [ ]:
# element by element operation
df + df

   0  1
0  2  4
1  6  8

In [ ]:
# broadcasting the smaller vector
# NOTE: each element of the vector is applied to 
#       a column in the dataframe
df + [10, 20]

    0   1
0  11  22
1  13  24

In [ ]:
# broadcasting a scalar
# NOTE: the scalar is applied to ALL elements
#       of the dataframe
df + 10

    0   1
0  11  12
1  13  14

In [ ]:
# we can now say things like this
df + df == 2*df

      0     1
0  True  True
1  True  True

# Duplicate Data

Identify and remove duplicate rows in a DataFrame

In [87]:
# make a dataframe with duplicate rows 'b' and 'e'
df2.iloc[4,:] = df2.iloc[1,:]
df2

        one       two     three
a -0.272183  0.424625  0.374375
b -0.316256  0.419623 -0.146409
c -1.429586  0.735792 -0.298281
d -0.295857 -0.206647 -0.670271
e -0.316256  0.419623 -0.146409
f -0.316256  0.419623 -0.146409

In [88]:
# check if there is duplication
df2.duplicated()

a    False
b    False
c    False
d    False
e     True
f     True
dtype: bool

In [89]:
df2[df2.duplicated()]

        one       two     three
e -0.316256  0.419623 -0.146409
f -0.316256  0.419623 -0.146409

In [90]:
# drop e!
df2.drop_duplicates()

        one       two     three
a -0.272183  0.424625  0.374375
b -0.316256  0.419623 -0.146409
c -1.429586  0.735792 -0.298281
d -0.295857 -0.206647 -0.670271

By default **duplicated()** and **drop_duplicates()** keep the first and identify other reoccuring instances as duplicates.

# Reading

* 2 [The Basics of NumPy Arrays](https://jakevdp.github.io/PythonDataScienceHandbook/02.02-the-basics-of-numpy-arrays.html)
* 3.2 [Data Indexing and Selection](https://jakevdp.github.io/PythonDataScienceHandbook/03.02-data-indexing-and-selection.html)
* 3.3 [Operating on Data in Pandas](https://jakevdp.github.io/PythonDataScienceHandbook/03.03-operations-in-pandas.html)
* 3.4 [Handling Missing Data](https://jakevdp.github.io/PythonDataScienceHandbook/03.04-missing-values.html)
* 3.6 [Combining Datasets: Concat and Append](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html)
* 3.7 [Combining Datasets: Merge and Join](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html)
* 3.8 [Aggregation and Grouping](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html)

## Homework 

* Access or Download the messy COVID-19 dataset from [Github](https://raw.githubusercontent.com/IndraniMandal/CSC310-S20/master/messy_covid19_southamerica%20-%20covid19_southamerica.csv)
* Examine the dataset for missing values
* Which column has maximum missing value? What % value are missing in that column? Should you keep this column or drop it? Why?
* There are some columns with only few data points missing. Should you drop these columns too? Why or why not? How should you handle these specific data points(particular row)?
* There are some data that has incorrect information like instead of a number they might have strings. How are you handleing these data points(rows)?
* After you have cleaned your data, create a plot of top 10 countries with most number of confirmed cases.